Revit 2026 API

# RebarConstrainedHandleGetHandleSurface Method

---

Gets the surface of this handle.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Surface GetHandleSurface()
```
```vb
Public Function GetHandleSurface As Surface
```
```cpp
public:
Surface^ GetHandleSurface()
```
```fsharp
member GetHandleSurface : unit -> Surface
```

#### Return Value

Surface Returns the surface of this handle.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | RebarConstrainedHandle is no longer valid. -or- This handle doesn't belongs to a shape driven rebar. |

This function takes into account the handle behavior This function works only for shape driven rebar. Usualy the return surface is a plane. Only for segments of bars whose shape has a RebarShapeDefinitionByArc will return a cylindrical surface.

#### Reference

RebarConstrainedHandle Class

Autodesk.Revit.DB.Structure Namespace